<%@ page language="java" contentType="text/html;charset=euc-kr"%>
<%
    /* ============================================================================== */
    /* =   PAGE : 공통 통보 PAGE                                                    = */
    /* = -------------------------------------------------------------------------- = */
    /* =   연동시 오류가 발생하는 경우 아래의 주소로 접속하셔서 확인하시기 바랍니다.= */
    /* =   접속 주소 : http://kcp.co.kr/technique.requestcode.do			        = */
    /* = -------------------------------------------------------------------------- = */
    /* =   Copyright (c)  2013   KCP Inc.   All Rights Reserverd.                   = */
    /* ============================================================================== */
%>
<%!
    /* ============================================================================== */
    /* =   null 값을 처리하는 메소드                                                = */
    /* = -------------------------------------------------------------------------- = */
        public String f_get_parm( String val )
        {
          if ( val == null ) val = "";
          return  val;
        }
    /* ============================================================================== */
%>
<%
    /* ============================================================================== */
    /* =   01. 공통 통보 페이지 설명(필독!!)                                        = */
    /* = -------------------------------------------------------------------------- = */
    /* =   공통 통보 페이지에서는,                                                  = */
    /* =   가상계좌 입금 통보 데이터와 모바일안심결제 통보 데이터 등을 KCP를 통해   = */
    /* =   실시간으로 통보 받을 수 있습니다.                                        = */
    /* =                                                                            = */
    /* =   common_return 페이지는 이러한 통보 데이터를 받기 위한 샘플 페이지        = */
    /* =   입니다. 현재의 페이지를 업체에 맞게 수정하신 후, 아래 사항을 참고하셔서  = */
    /* =   KCP 관리자 페이지에 등록해 주시기 바랍니다.                              = */
    /* =                                                                            = */
    /* =   등록 방법은 다음과 같습니다.                                             = */
    /* =  - KCP 관리자페이지(admin.kcp.co.kr)에 로그인 합니다.                      = */
    /* =  - [쇼핑몰 관리] -> [정보변경] -> [공통 URL 정보] -> 공통 URL 변경 후에    = */
    /* =    가맹점 URL을 입력합니다.                                                = */
    /* ============================================================================== */


    /* ============================================================================== */
    /* =   02. 공통 통보 데이터 받기                                                = */
    /* = -------------------------------------------------------------------------- = */
    String site_cd          = f_get_parm( request.getParameter( "site_cd"		   ) );    // 사이트 코드
    String tno              = f_get_parm( request.getParameter( "tno"              ) );    // KCP 거래번호
    String ordr_idxx        = f_get_parm( request.getParameter( "ordr_idxx"        ) );    // 주문번호
    String tx_cd            = f_get_parm( request.getParameter( "tx_cd"            ) );    // 업무처리 구분 코드
    String tx_tm            = f_get_parm( request.getParameter( "tx_tm"            ) );    // 업무처리 완료 시간
    /* = -------------------------------------------------------------------------- = */
    String ipgm_name        = "";                                                          // 주문자명
    String remitter         = "";                                                          // 입금자명
    String ipgm_mnyx        = "";                                                          // 입금금액
  /*   String bank_code        = "";                                                          // 은행코드 */
    String account          = "";                                                          // 가상계좌 입금계좌번호
    String op_cd            = "";                                                          // 처리구분 코드
    String noti_id          = "";                                                          // 통보 아이디
    /* = -------------------------------------------------------------------------- = */
    String refund_nm        = "";                                                          // 환불계좌주명
    String refund_mny       = "";                                                          // 환불금액
    String bank_code        = "";                                                          // 은행코드
    /* = -------------------------------------------------------------------------- = */
    String st_cd            = "";                                                          // 구매확인 코드
    String can_msg          = "";                                                          // 구매취소 사유
    /* = -------------------------------------------------------------------------- = */
    String waybill_no       = "";                                                          // 운송장 번호
    String waybill_corp     = "";                                                          // 택배 업체명
    /* = -------------------------------------------------------------------------- = */
    String cash_a_no        = "";                                                          // 현금영수증 승인번호
    /* = -------------------------------------------------------------------------- = */
    /* =   02-1. 가상계좌 입금 통보 데이터 받기                                     = */
    /* = -------------------------------------------------------------------------- = */
    if ( tx_cd.equals("TX00") )
    {
        ipgm_name = f_get_parm( request.getParameter( "ipgm_name" ) );           // 주문자명
        remitter  = f_get_parm( request.getParameter( "remitter"  ) );           // 입금자명
        ipgm_mnyx = f_get_parm( request.getParameter( "ipgm_mnyx" ) );           // 입금 금액
        bank_code = f_get_parm( request.getParameter( "bank_code" ) );           // 은행코드
        account   = f_get_parm( request.getParameter( "account"   ) );           // 가상계좌 입금계좌번호
        op_cd     = f_get_parm( request.getParameter( "op_cd"     ) );           // 처리구분 코드
        noti_id   = f_get_parm( request.getParameter( "noti_id"   ) );           // 통보 아이디
        cash_a_no = f_get_parm( request.getParameter( "cash_a_no" ) );           // 현금영수증 승인번호
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   02-2. 가상계좌 환불 통보 데이터 받기                                      = */
    /* = -------------------------------------------------------------------------- = */
    else if ( tx_cd.equals("TX01") )
    {
        refund_nm  = f_get_parm( request.getParameter( "refund_nm"  ) );         // 환불계좌주명
        refund_mny = f_get_parm( request.getParameter( "refund_mny" ) );         // 환불금액
        bank_code  = f_get_parm( request.getParameter( "bank_code"  ) );         // 은행코드
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   02-3. 구매확인/구매취소 통보 데이터 받기                                 = */
    /* = -------------------------------------------------------------------------- = */
    else if ( tx_cd.equals("TX02") )
    {
        st_cd = f_get_parm( request.getParameter( "st_cd" ) );                   // 구매확인 코드

        if ( st_cd.equals("N") )                                                 // 구매확인 상태가 구매취소인 경우
        {
            can_msg = f_get_parm( request.getParameter( "can_msg" ) );           // 구매취소 사유
        }
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   02-4. 배송시작 통보 데이터 받기                                          = */
    /* = -------------------------------------------------------------------------- = */
    else if ( tx_cd.equals("TX03") )
    {
        waybill_no   = f_get_parm( request.getParameter( "waybill_no"   ) );     // 운송장 번호
        waybill_corp = f_get_parm( request.getParameter( "waybill_corp" ) );     // 택배 업체명
    }
    /* ============================================================================== */


    /* ============================================================================== */
    /* =   03. 공통 통보 결과를 업체 자체적으로 DB 처리 작업하시는 부분입니다.      = */
    /* = -------------------------------------------------------------------------- = */
    /* =   통보 결과를 DB 작업 하는 과정에서 정상적으로 통보된 건에 대해 DB 작업을  = */
    /* =   실패하여 DB update 가 완료되지 않은 경우, 결과를 재통보 받을 수 있는     = */
    /* =   프로세스가 구성되어 있습니다. 소스에서 result 라는 Form 값을 생성 하신   = */
    /* =   후, DB 작업이 성공 한 경우, result 의 값을 "0000" 로 세팅해 주시고,      = */
    /* =   DB 작업이 실패 한 경우, result 의 값을 "0000" 이외의 값으로 세팅해 주시  = */
    /* =   기 바랍니다. result 값이 "0000" 이 아닌 경우에는 재통보를 받게 됩니다.   = */
    /* = -------------------------------------------------------------------------- = */

    /* = -------------------------------------------------------------------------- = */
    /* =   03-1. 가상계좌 입금 통보 데이터 DB 처리 작업 부분                        = */
    /* = -------------------------------------------------------------------------- = */
    if ( tx_cd.equals("TX00") )
    {
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   03-2. 가상계좌 환불 통보 데이터 DB 처리 작업 부분                        = */
    /* = -------------------------------------------------------------------------- = */
    else if ( tx_cd.equals("TX01") )
    {
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   03-3. 구매확인/구매취소 통보 데이터 DB 처리 작업 부분                    = */
    /* = -------------------------------------------------------------------------- = */
    else if ( tx_cd.equals("TX02") )
    {
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   03-4. 배송시작 통보 데이터 DB 처리 작업 부분                             = */
    /* = -------------------------------------------------------------------------- = */
    else if ( tx_cd.equals("TX03") )
    {
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   03-5. 정산보류 통보 데이터 DB 처리 작업 부분                             = */
    /* = -------------------------------------------------------------------------- = */
    else if ( tx_cd.equals("TX04") )
    {
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   03-6. 즉시취소 통보 데이터 DB 처리 작업 부분                             = */
    /* = -------------------------------------------------------------------------- = */
    else if ( tx_cd.equals("TX05") )
    {
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   03-7. 취소 통보 데이터 DB 처리 작업 부분                                 = */
    /* = -------------------------------------------------------------------------- = */
    else if ( tx_cd.equals("TX06") )
    {
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   03-8. 발급계좌해지 통보 데이터 DB 처리 작업 부분                         = */
    /* = -------------------------------------------------------------------------- = */
    else if ( tx_cd.equals("TX07") )
    {
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   03-9. 모바일계좌이체 통보 데이터 DB 처리 작업 부분                       = */
    /* = -------------------------------------------------------------------------- = */
    else if ( tx_cd.equals("TX08") )
    {
    }
    /* ============================================================================== */


    /* ============================================================================== */
    /* =   04. result 값 세팅 하기                                                  = */
    /* ============================================================================== */
%>
<html><body><form><input type="hidden" name="result" value="0000"></form></body></html>